{
  "metadata": {
    "filename": "Pakej_Rahmah_Siswa_Campaign.pdf",
    "filepath": "DocumentsPDF\\Pakej_Rahmah_Siswa_Campaign.pdf",
    "num_pages": 2,
    "file_size": 2694
  },
  "full_text": "--- Page 1 --- Terms & Conditions: Pakej Rahmah Siswa Campaign 1. Campaign Period: - Starts: 16 August 2024, 12:01 a.m. - Ends: 31 December 2024, 11:59 p.m. - CelcomDigi may extend or vary the period without prior notice. 2. Eligibility: - Open to Malaysian CelcomDigi Prepaid 5G Biru and Kuning Plan subscribers aged 25 or below. - Not eligible: Non-Malaysian subscribers, CelcomDigi Postpaid users, or Prepaid users above 25 years. - Participants under 18 require parental or guardian consent. 3. Campaign Entitlements: - 30GB of 5G/4G high-speed internet. - Data validity: 180 days from the subscription date. 4. Personal Data Usage: - Participants data may be used for campaign purposes, marketing, and publicity activities. - Participants agree to cooperate in advertising and promotional activities without extra consent or payment. 5. Data Consent and Responsibility: - Participants ensure proper consents for any shared personal data. - Participants must notify CelcomDigi of changes to shared data. 6. Release and Liability: --- Page 2 --- - CelcomDigi is not liable for losses, damages, or claims arising from participation in the campaign. - This includes hardware/software malfunctions, data transmission issues, or events beyond CelcomDigis control. 7. CelcomDigi Rights: - Reserves the right to verify entries and reject non-compliant or fraudulent entries. - May alter, suspend, or terminate the campaign without prior notice. 8. Exclusion of Warranties: - CelcomDigi disclaims all express or implied warranties regarding campaign items or benefits. 9. Indemnity: - Participants indemnify CelcomDigi against third-party claims or losses arising from campaign participation. 10. Final Decisions: - CelcomDigis decisions are final, and no correspondence will be entertained. 11. Governing Laws: - The campaign is governed by Malaysian law and subject to Malaysian courts. 12. Other Terms: - All other CelcomDigi mobile telecommunication service terms apply.",
  "page_texts": [
    {
      "page_num": 1,
      "text": "Terms & Conditions: Pakej Rahmah Siswa Campaign 1. Campaign Period: - Starts: 16 August 2024, 12:01 a.m. - Ends: 31 December 2024, 11:59 p.m. - CelcomDigi may extend or vary the period without prior notice. 2. Eligibility: - Open to Malaysian CelcomDigi Prepaid 5G Biru and Kuning Plan subscribers aged 25 or below. - Not eligible: Non-Malaysian subscribers, CelcomDigi Postpaid users, or Prepaid users above 25 years. - Participants under 18 require parental or guardian consent. 3. Campaign Entitlements: - 30GB of 5G/4G high-speed internet. - Data validity: 180 days from the subscription date. 4. Personal Data Usage: - Participants data may be used for campaign purposes, marketing, and publicity activities. - Participants agree to cooperate in advertising and promotional activities without extra consent or payment. 5. Data Consent and Responsibility: - Participants ensure proper consents for any shared personal data. - Participants must notify CelcomDigi of changes to shared data. 6. Release and Liability:",
      "char_count": 1018
    },
    {
      "page_num": 2,
      "text": "- CelcomDigi is not liable for losses, damages, or claims arising from participation in the campaign. - This includes hardware/software malfunctions, data transmission issues, or events beyond CelcomDigis control. 7. CelcomDigi Rights: - Reserves the right to verify entries and reject non-compliant or fraudulent entries. - May alter, suspend, or terminate the campaign without prior notice. 8. Exclusion of Warranties: - CelcomDigi disclaims all express or implied warranties regarding campaign items or benefits. 9. Indemnity: - Participants indemnify CelcomDigi against third-party claims or losses arising from campaign participation. 10. Final Decisions: - CelcomDigis decisions are final, and no correspondence will be entertained. 11. Governing Laws: - The campaign is governed by Malaysian law and subject to Malaysian courts. 12. Other Terms: - All other CelcomDigi mobile telecommunication service terms apply.",
      "char_count": 921
    }
  ],
  "chunks": [
    "--- Page 1 --- Terms & Conditions: Pakej Rahmah Siswa Campaign 1. Campaign Period: - Starts: 16 August 2024, 12:01 a.m. - Ends: 31 December 2024, 11:59 p.m. - CelcomDigi may extend or vary the period without prior notice. 2. Eligibility: - Open to Malaysian CelcomDigi Prepaid 5G Biru and Kuning Plan subscribers aged 25 or below. - Not eligible: Non-Malaysian subscribers, CelcomDigi Postpaid users, or Prepaid users above 25 years. - Participants under 18 require parental or guardian consent. 3. Campaign Entitlements: - 30GB of 5G/4G high-speed internet. - Data validity: 180 days from the subscription date. 4. Personal Data Usage: - Participants data may be used for campaign purposes, marketing, and publicity activities. - Participants agree to cooperate in advertising and promotional activities without extra consent or payment. 5. Data Consent and Responsibility: - Participants ensure proper consents for any shared personal data.",
    "s agree to cooperate in advertising and promotional activities without extra consent or payment. 5. Data Consent and Responsibility: - Participants ensure proper consents for any shared personal data. - Participants must notify CelcomDigi of changes to shared data. 6. Release and Liability: --- Page 2 --- - CelcomDigi is not liable for losses, damages, or claims arising from participation in the campaign. - This includes hardware/software malfunctions, data transmission issues, or events beyond CelcomDigis control. 7. CelcomDigi Rights: - Reserves the right to verify entries and reject non-compliant or fraudulent entries. - May alter, suspend, or terminate the campaign without prior notice. 8. Exclusion of Warranties: - CelcomDigi disclaims all express or implied warranties regarding campaign items or benefits. 9. Indemnity: - Participants indemnify CelcomDigi against third-party claims or losses arising from campaign participation. 10.",
    "all express or implied warranties regarding campaign items or benefits. 9. Indemnity: - Participants indemnify CelcomDigi against third-party claims or losses arising from campaign participation. 10. Final Decisions: - CelcomDigis decisions are final, and no correspondence will be entertained. 11. Governing Laws: - The campaign is governed by Malaysian law and subject to Malaysian courts. 12. Other Terms: - All other CelcomDigi mobile telecommunication service terms apply."
  ],
  "total_chunks": 3,
  "total_characters": 1970
}